{
    "series": {
        "c0c8d5878d8f": {
            "title": "Honour: It Starts with Me",
            "sermons": {
                "f5ee77cd": {
                    "title": "Week 1",
                    "speaker": "Rebecca Ng",
                    "datetime": 1657947600000,
                    "youtubeId": "HproFHcP_GQ",
                    "content": "`Definition of Honour: Valuable, precious, appreciation, favourable, respect, weighty like gold`\n`Dishonour - Atimia: To not show respect or value, to treat as common or ordinary`\nParents, Authority, Friends, Those under us, God.\nShow me a person of honour, I'll show you a person who will be carrying favour with God and men.\n\n# 1. Honour is the mark of a Christian\n> John 13:34-34 NLT\nWhen you grow in Christ, the way we see people change = the way we treat people change\nThe world seems to know the mark of a Christian by what we are against.\nHow about people knowing the mark of a Christian by what we are for?\nDo people know what you are a believer by what you are against, or what you are for?\n\n# 2. Honour chooses to say no one is ordinary\n> Mark 10:13-16 NLT\nHonour can be displayed in action, words or even thoughts. But true honour starts from the heart.\n> Isaiah 29:13 NIV\n## John Bevere - The real question\nNot - Am I honouring others?\nBut - Am I treating others as common/ordinary?`\n## C.S Lewis, The Weight of Glory\n`There are no ordinary people. You have never talked to a mere mortal.`\n\n# 3. Honour brings people closer to what God is doing\n## John Bevere\n`..show me a person who has no regard for authority and I will show you a person who is not a child of God. When you meet God, you meet authority, because God and His authority are inseparable.`\n> Mark 6:1-5 NLT\nWe restrain ourselves from what God is doing when we choose not to honour.\nTo the world: Dishonour is humiliation, rejection\nTo Jesus: Dishonour is treating as ordinary, common"
                },
                "c0c8ddbc": {
                    "title": "Week 2",
                    "speaker": "Rebecca Ng",
                    "datetime": 1658552400000,
                    "youtubeId": "h-5HKwNA2fY",
                    "content": "`Definition of Honour: Valuable, precious, appreciation, favourable, respect, weighty like gold`\n`Dishonour - Atimia: To not show respect or value, to treat as common or ordinary`\n> 1 Peter 2:17 TPT\nLie: I will honour if the person deserves it\nTruth: My choice to honour will not be tied to my feelings or judgement. I will choose to honour because Jesus is my King.\n`Definition of Respect: A feeling of deep admiration for someone or something elicited by their abilities, qualities, or achievements.`\n`Honour: Regard with great respect, with respect so great it doesn't make sense.`\nIs your idea of honour based on you or is it based on the Word of God? When we honour others, no matter who they are, we honour God.\nThere is order, rank and delegated authority. Order is God's idea!\n\n# 1. Civil Authorities - Government appointed by God\n> Romans 13:1 NLT\n\n# 2. Church\n> Hebrews 13:17 NLT\n\n# 3. Family - Parents\n(Movies show how teenagers win because the parents finally got it...)\n> Ephesians 6:2-3 NLT\n> Deuteronomy 27:16 NLT\n\n# 4. Social - Teachers, coaches, bosses...\n> 1 Timothy 6:1-2 NLT\nWhen we honour those above us, we honour God.\n> Romans 12:20-21 NLT\n> Proverbs 3:3-4 NKJV"
                }
            }
        },
        "4b10b3738279": {
            "title": "Break Free",
            "sermons": {
                "0a067ae8": {
                    "title": "Week 1",
                    "speaker": "Rebcca Ng",
                    "datetime": 1663390800000,
                    "youtubeId": "H4qCDkTFgaQ",
                    "content": "While technology has many advantages, it has produced a whole new level of hurt, rejection and bondage.\n\n# 30 years... now.\n- Single-parent household: all time high\n- Sexual innuendo: music, movies, cable series no longer a suggestion, its explicit\n- Violence in schools\n\n# COVID\n- Alone and isolated\n- Stress, depression, suicide, obesity\n- Teens are forced to grow up fast\n\nWhile troubles have undoubtedly grown, the solution to finding real and lasting freedom is the same. The answer is still Jesus.\n\n# The Reality of the Dark Side\nDeceived = Defeated Lives\n> 1 Corinthians 3:2-3 NASB\nThe father of lies can block your victory as a Christian if he can deceive you into believing that you are nothing but a product of your past - ruled by sin, stuck in the failure mode, and controlled by your habits.\n\nSociety thinks mostly if something is not right physically/mentally, it is a hardware (external) problem. We believe the main problem is in the software (internal).\nYou may be afraid to say because you think that people will think that you are crazy.\nIf you hear tormenting voices in your head or feel a dark presence in your room at night - you're not crazy, you're not alone!\n47 percent of American students said so too!\nMany Christians don't complain about hearing voices, but their minds are filled with such confusion that their walk with Christ is completely discouraging.\n\n# Has this happened before?\n- When you try to pray, you begin thinking about a million things you should be doing.\n- When you sit down to read the bible or a good Christian book, you can't concentrate.\n- When you have an opportunity to serve in some way, you give up because of thoughts of self-doubt: \"I'm not a strong Christian\"; \"I don't know enough about the Bible\"; \"I'm too young\"; \"I have too many sinful thoughts\"; \"My ability is not there\"; \"I will be judged\".\n- When you run to God again, you think \"I will give up anyway again\".\n- When you are able to get help or go to church \"Don't go, they can't help you\" or distracting thoughts will come \"I tried this before and it didn't work\"; \"I don't want to go\".\nSome of this discouragement is because of our own faulty thinking, but it can also reflect deception from the enemy.\n> Ephesians 6:12 NLT\nWe all need a revelation (realisation by the holy spirit) of the areas we are held bondage to.\nBondage = Restraining, tying, trapping you so that you are a slave.\n> John 8:34-36 NLT\n\n# A Lost Sheep\n`Dear God, where are you? How can you watch and not help me? I hurt so bad, and you don't even care. If you cared you'd make it stop or let me die. I love you, but you seem so far away. I can't hear you or feel you or see you, but I'm supposed to believe you're here. Lord, I feel them and hear them. They are here. I know you're real, God, but they are more real to me right now. Please make someone believe me, Lord. Why won't you make it stop? Please, Lord, please! If you love me you'll let me die.`"
                }
            }
        }
    },
    "standalone": {}
}
